fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОтпускаСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда) 
	
	Если Объект.ОтпускаСотрудников.Количество() <> 0 Тогда
		
		Результат = Ждать ВопросАсинх("Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);   	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
	|	РАЗНОСТЬДАТ(ОтпускаСотрудников.ДатаНачала, ОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1 КАК ПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_ОтпускаСотрудников
	|ИЗ
	|	&ОтпускаСотрудников КАК ОтпускаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_ОтпускаСотрудников.ПродолжительностьОтпуска) КАК ПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_ОтпускаСгрупп
	|ИЗ
	|	ВТ_ОтпускаСотрудников КАК ВТ_ОтпускаСотрудников
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтпускаСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_ОтпускаСгрупп.ПродолжительностьОтпуска, 0) КАК ПродолжительностьОтпуска
	|ИЗ
	|	ВТ_ОтпускаСотрудников КАК ВТ_ОтпускаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтпускаСгрупп КАК ВТ_ОтпускаСгрупп
	|		ПО ВТ_ОтпускаСотрудников.Сотрудник = ВТ_ОтпускаСгрупп.Сотрудник";
	
	
	ОтпускаСотр = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания" );
	Запрос.УстановитьПараметр("ОтпускаСотрудников",ОтпускаСотр);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();   
	
	Пока ТаблицаОтпусков.Следующий() Цикл
		Объект.ОтпускаСотрудников[ТаблицаОтпусков.НомерСтроки - 1].ПродолжительностьОтпуска = ТаблицаОтпусков.ПродолжительностьОтпуска;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК BKM_Сотрудники
	|ГДЕ
	|	НЕ BKM_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников,Объект.ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти
